import { TimeSegment } from "../types/type";

export const timeSegmentsData: TimeSegment[] = [
  {
    id: 1,
    periodFrom: 1987,
    periodTo: 1991,
    title: "Кино",
    category: "Кино",
    events: [
      {
        id: 1,
        date: "1987",
        description: "«Хищник»/Predator, США (реж. Джон Мактирнан)",
      },
      {
        id: 2,
        date: "1988",
        description:
          "«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)",
      },
      {
        id: 3,
        date: "1989",
        description:
          "«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)",
      },
      {
        id: 4,
        date: "1990",
        description: "«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)",
      },
      {
        id: 5,
        date: "1991",
        description:
          "«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)",
      },
      {
        id: 6,
        date: "1991",
        description:
          "«Молчание ягнят»/The Silence of the Lambs, США (реж. Джонатан Демми)",
      },
    ],
  },
  {
    id: 2,
    periodFrom: 1992,
    periodTo: 1993,
    title: "Литература",
    category: "Литература",
    events: [
      {
        id: 1,
        date: "1992",
        description:
          "Нобелевская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах».",
      },
      {
        id: 2,
        date: "1992",
        description: "Выходит роман «Бессонница» Стивена Кинга",
      },
      {
        id: 3,
        date: "1993",
        description:
          "Публикация первой книги «Игры престолов» из цикла «Песнь льда и пламени» Джорджа Р. Р. Мартина",
      },
      {
        id: 4,
        date: "1993",
        description:
          "Роман «Протоколы ведьм» Умберто Эко становится международным бестселлером",
      },
      {
        id: 5,
        date: "1993",
        description:
          "Выходит культовый роман «Джонатан Стрендж и мистер Норрелл» Саманты Шэннон",
      },
      {
        id: 6,
        date: "1993",
        description:
          "Публикация сборника «Отчаяние» Владимира Набокова на русском языке",
      },
    ],
  },
  {
    id: 3,
    periodFrom: 1994,
    periodTo: 1996,
    title: "Математика",
    category: "Математика",
    events: [
      {
        id: 1,
        date: "1994",
        description: "Доказательство Великой теоремы Ферма Эндрю Уайлсом",
      },
      {
        id: 2,
        date: "1994",
        description:
          "Разработка алгоритма SHA-1 для криптографических хеш-функций",
      },
      {
        id: 3,
        date: "1995",
        description:
          "Открытие алгоритма RSA в криптографии и его практическое применение",
      },
      {
        id: 4,
        date: "1995",
        description:
          "Доказательство гипотезы Кеплера о наиболее плотной упаковке шаров",
      },
      {
        id: 5,
        date: "1996",
        description:
          "Разработка новых методов в теории чисел и алгебраической геометрии",
      },
      {
        id: 6,
        date: "1996",
        description:
          "Прорыв в решении задач оптимизации и исследовании операций",
      },
    ],
  },
  {
    id: 4,
    periodFrom: 1997,
    periodTo: 2001,
    title: "Астрономия",
    category: "Астрономия",
    events: [
      {
        id: 1,
        date: "1997",
        description:
          "Запуск космического аппарата «Кассини-Гюйгенс» для исследования Сатурна",
      },
      {
        id: 2,
        date: "1998",
        description: "Открытие ускоренного расширения Вселенной",
      },
      {
        id: 3,
        date: "1999",
        description: "Запуск рентгеновской обсерватории «Чандра» NASA",
      },
      {
        id: 4,
        date: "2000",
        description:
          "Первые постоянные экипажи на Международной космической станции",
      },
      {
        id: 5,
        date: "2001",
        description: "Открытие новых экзопланет в зоне обитаемости звезд",
      },
      {
        id: 6,
        date: "2001",
        description:
          "Запуск космического телескопа «WMAP» для изучения реликтового излучения",
      },
    ],
  },
  {
    id: 5,
    periodFrom: 2001,
    periodTo: 2007,
    title: "Физика",
    category: "Физика",
    events: [
      {
        id: 1,
        date: "2002",
        description:
          "Нобелевская премия по физике за исследования в области астрофизики",
      },
      {
        id: 2,
        date: "2003",
        description:
          "Открытие новых свойств графена и его применение в нанотехнологиях",
      },
      {
        id: 3,
        date: "2004",
        description:
          "Прорыв в исследованиях квантовых компьютеров и квантовой запутанности",
      },
      {
        id: 4,
        date: "2005",
        description:
          "Экспериментальное подтверждение существования бозона Хиггса",
      },
      {
        id: 5,
        date: "2006",
        description: "Развитие нанотехнологий и создание новых метаматериалов",
      },
      {
        id: 6,
        date: "2007",
        description:
          "Достижения в области сверхпроводимости при высоких температурах",
      },
    ],
  },
  {
    id: 6,
    periodFrom: 2007,
    periodTo: 2011,
    title: "Химия",
    category: "Химия",
    events: [
      {
        id: 1,
        date: "2008",
        description:
          "Нобелевская премия по химии за открытие и развитие зеленого флуоресцентного белка",
      },
      {
        id: 2,
        date: "2008",
        description: "Синтез новых металлоорганических каркасных структур",
      },
      {
        id: 3,
        date: "2009",
        description: "Разработка новых катализаторов для органического синтеза",
      },
      {
        id: 4,
        date: "2010",
        description: "Прорыв в создании молекулярных машин и наноматериалов",
      },
      {
        id: 5,
        date: "2011",
        description:
          "Открытие квазикристаллов и новых форм организации вещества",
      },
      {
        id: 6,
        date: "2011",
        description:
          "Развитие методов криоэлектронной микроскопии для изучения биомолекул",
      },
    ],
  },
];
